{"updates":[{"id":"recvYv6S6gAKY7NLP","headline":"Ramadan 2026 Expected to Begin Around February 18 — Tourist Guidelines Updated","summary":"The holy month of Ramadan is expected to begin around February 18, 2026, depending on the moon sighting. During Ramadan, eating, drinking, and smoking in public during daylight hours is prohibited by law — this applies to tourists as well. Restaurants in hotels and malls typically offer screened-off dining areas for non-fasting visitors. Many attractions adjust their hours, and nightlife slows down until iftar. After sunset, the UAE comes alive with night markets, special iftar buffets, and cultural events. Tourists are advised to dress more conservatively during this period and show respect for those who are fasting.","source_name":"WAM","category":"Legal","published_date":"2026-02-14"},{"id":"recG2zseyh3775Ccf","headline":"UAE Expands Golden Visa Scheme With Emergency Consular Support for Holders Abroad","summary":"The UAE has expanded benefits for Golden Visa holders by offering emergency consular support services overseas — a benefit previously only available to Emirati citizens. Golden Visa holders can now access emergency assistance from UAE embassies and consulates worldwide. The 10-year Golden Visa is available to investors, entrepreneurs, scientists, outstanding students, and skilled professionals. The move is part of the UAE's strategy to attract and retain top global talent by making long-term residency more appealing with tangible benefits beyond just residency rights.","source_name":"The National","category":"Visa","published_date":"2026-02-12"},{"id":"rec3jwwCuKLZXTwpY","headline":"Al Layan Oasis: New 1 Million Sq Metre Desert Tourism Destination Coming to Dubai","summary":"Sheikh Mohammed bin Rashid has announced plans for Al Layan Oasis, a vast new desert tourism destination spanning one million square metres in Dubai. The project is expected to attract over 300,000 visitors annually and will feature luxury desert resorts, cultural experiences, adventure activities, and wildlife conservation areas. The development aims to diversify Dubai's tourism offering beyond the city's urban attractions, giving visitors an authentic Arabian desert experience. It joins other mega-projects like Dubai South and the Museum of the Future in positioning Dubai as a year-round global tourism capital.","source_name":"The National","category":"General","published_date":"2026-02-10"},{"id":null,"headline":"Standard tourist visa is 30 days on arrival for US, UK, EU & Australian citizens","summary":"","source_name":"UAESurfer","category":"Visa","published_date":""},{"id":null,"headline":"Download the Careem or UBER app before you land — easiest transport in any emirate","summary":"","source_name":"UAESurfer","category":"Transport","published_date":""}]}